name: "HardTestNet"
layer {
  name: "data"
  type: "SequenceData"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  sequence_data_param {
#    feature_source: "/media/remote_home/akukleva/mnt/cvg30_work_kuehne/Weak_YouTube/train/vid_clips_noOld/feature_s3_new"
#    feature_description: "/media/remote_home/akukleva/scripts/video_descriptors/spatial_descriptor_test.txt"
#    feature_source: "/media/remote_home/akukleva/scripts/video_descriptors"
#    feature_description: "/media/remote_home/akukleva/scripts/video_descriptors/test_descriptor.txt"
    feature_source: "/media/data/feature_auto_bin"
    feature_description: "/media/data/descriptors/auto_bin_descriptors.txt"
    feature_size: 257
    batch_size: 256
    num_frames: 1
    num_segments: 3
    num_shots: 7
    modality: RGB
    shuffle: true
  }
}
layer {
  name: "data"
  type: "SequenceData"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  sequence_data_param {
#    feature_source: "/media/remote_home/akukleva/mnt/cvg30_work_kuehne/Weak_YouTube/train/vid_clips_noOld/feature_s3_new"
#    feature_description: "/media/remote_home/akukleva/scripts/video_descriptors/spatial_descriptor_test.txt"
#    feature_source: "/media/remote_home/akukleva/scripts/video_descriptors"
#    feature_description: "/media/remote_home/akukleva/scripts/video_descriptors/test_descriptor.txt"
    feature_source: "/media/data/feature_auto_bin"
    feature_description: "/media/data/descriptors/auto_bin_descriptors.txt"
    feature_size: 257
    batch_size: 1
    num_frames: 1
    num_segments: 3
    num_shots: 1
    modality: RGB
    shuffle: true
  }
}
layer { name: "data_reshape" type: "Reshape" bottom: "data" top: "data_reshape" reshape_param { shape { dim: [-1, 1, 1, 257] } }}

layer {
  name: "fc-action"
  type: "InnerProduct"
  bottom: "data_reshape"
  top: "fc"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 513
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "reshape_fc"
  type: "Reshape"
  bottom: "fc"
  top: "reshape_fc"
  reshape_param {
    shape {
      dim: -1
      dim: 1
      dim: 3
      dim: 513
    }
  }
}
layer {
  name: "segment_consensus"
  type: "Pooling"
  bottom: "reshape_fc"
  top: "pool_fc"
  pooling_param {
    pool: AVE
    kernel_h: 3
    kernel_w: 1
  }
}


layer {
  name: "reshape_u_fc"
  type: "Reshape"
  bottom: "pool_fc"
  top: "reshape_u_fc"
  include {
    phase: TRAIN
  }
  reshape_param {
    shape {
      dim: -1
      dim: 7
      dim: 513
    }
  }
}
layer {
  name: "shot_consensus_u"
  type: "BatchReduction"
  bottom: "reshape_u_fc"
  top: "pool_u_fc"
  include {
    phase: TRAIN
  }
  batch_reduction_param {
    reduction_param {
      operation: TOPK
      axis: 1
      k: 3
    }
  }
}

layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "pool_u_fc"
  bottom: "label"
  top: "loss-u"
  include {
    phase: TRAIN
  }
  softmax_param {
    axis: 1
  }
}

layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "pool_fc"
  bottom: "label"
  top: "loss"
  include {
    phase: TEST
  }
  softmax_param {
    axis: 3
  }
}
layer {
  name: "accuracy_top1"
  type: "Accuracy"
  bottom: "pool_fc"
  bottom: "label"
  top: "accuracy"
  include {
    phase: TEST
  }
  accuracy_param {
    axis: 3
  }
}



