
name: "BN-Inception"
mem_param {
  optimize_test: true
  optimize_train: true
}
layer { 
  name: "data"
  type: "SequenceData"
  top: "data"
  top: "label"
  sequence_data_param {
    video_source: "../data/anet1.2/anet_1.2_untrimmed_train_val_rgb_list.txt"
    shot_source: "../data/anet1.2/anet_1.2_untrimmed_train_val_shot_list.txt"
    batch_size: 7
    num_frames: 1
    num_segments: 3
    num_shots: 7
    modality: RGB
    shuffle: true
    name_pattern: "image_%06d.jpg"
  }
   transform_param{
    crop_size: 224
    mirror: true
    fix_crop: true
    more_fix_crop: true
    multi_scale: true
    max_distort: 1
    scale_ratios:[1, .875, .75, .66]
    is_flow: false 
    # mean_value: [104, 117, 123]   
    mean_value: [104, 117, 123, 104, 117, 123, 104, 117, 123]
    mean_value: [104, 117, 123, 104, 117, 123, 104, 117, 123]
    mean_value: [104, 117, 123, 104, 117, 123, 104, 117, 123]
    mean_value: [104, 117, 123, 104, 117, 123, 104, 117, 123]
    mean_value: [104, 117, 123, 104, 117, 123, 104, 117, 123]
    mean_value: [104, 117, 123, 104, 117, 123, 104, 117, 123]
    mean_value: [104, 117, 123, 104, 117, 123, 104, 117, 123]
  }
  include: { phase: TRAIN }
}
layer {
  name: "data"
  type: "VideoData"
  top: "data"
  top: "label"
  video_data_param {
    source: "../data/anet1.2/anet_1.2_untrimmed_train_rgb_list.txt"
    batch_size: 1
    new_length: 1
    num_segments: 3
    modality: RGB
    name_pattern: "image_%06d.jpg"
  }
  transform_param{
    crop_size: 224
    mirror: false
    is_flow: false
    mean_value: [104, 117, 123, 104, 117, 123, 104, 117, 123]
  }
  include: { phase: TEST }
}
layer { name: "data_reshape" type: "Reshape" bottom: "data" top: "data_reshape" reshape_param { shape { dim: [-1, 3, 224, 224] } }}

####################################### loss accuracy #######################################

layer { name: "fc-action" type: "InnerProduct" bottom: "global_pool" top: "fc"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
  inner_product_param { num_output: 100
    weight_filler { type: "gaussian" std: 0.001 }
    bias_filler { type: "constant" value: 0 } } }

layer { name: "reshape_fc" type: "Reshape" bottom: "fc" top: "reshape_fc" reshape_param { shape { dim: [-1, 1, 3, 100] } } }
layer { name: "segment_consensus" type: "Pooling" bottom: "reshape_fc" top: "pool_fc" pooling_param { pool: AVE kernel_h: 3 kernel_w: 1 } } 


layer { name: "reshape_u_fc" type: "Reshape" bottom: "pool_fc" top: "reshape_u_fc" reshape_param { shape { dim: [-1, 7, 100] } } 
  include { phase: TRAIN } }
layer { name: "shot_consensus_u" type: "BatchReduction" bottom: "reshape_u_fc" top: "pool_u_fc"
  batch_reduction_param { reduction_param { operation: TOPK k: 3 axis: 1 } } 
  include { phase: TRAIN } }

layer { name: "loss" type: "SoftmaxWithLoss" bottom: "pool_u_fc" bottom: "label" top: "loss-u" softmax_param {axis: 1 } 
  include: { phase: TRAIN } }
layer { name: "loss" type: "SoftmaxWithLoss" bottom: "pool_fc" bottom: "label" top: "loss" softmax_param { axis: 3 } 
  include: { phase: TEST } }
layer { name: "accuracy_top1" type: "Accuracy" bottom: "pool_fc" bottom: "label" top: "accuracy" accuracy_param { axis:3 }
include { phase: TEST } }
